#%% for test
for i in range(0, 10, 1):
    print("%d. 김헌찬" %(i+1))
print("---------------------------------------------")
for i in range(10, 0, -1):
    print("%d. 김헌찬" %i)
print("---------------------------------------------")    
#0부터 1씩 증가시키는 for문을 작성한다.(10번 반복).
#단 10~1까지 출력한다.
for i in range(0, 10, 1):
    print(10 - i)
    
#%% for task

# =============================================================================
# 고수 : 반복문 시작값을 무조건 0으로 고정
# 1~100까지 출력
# 100~1까지 출력
# 1~100까지 중 짝수만 출력
# A~F까지 출력
# A~F까지 중 C제외하고 출력
# aBcDeFgHiJkLmNoPqRsTuVwXyZ 출력
# =============================================================================

# 1번 문제
for i in range(0, 100, 1):
    print(i+1)
print("--------------------------------------------------------------------")
#  2번 문제
for i in range(0 , 100, 1):
    print(100-i)
print("--------------------------------------------------------------------")
# 3번 문제
for i in range(0, 50, 1):
    print((i + 1) * 2)